#pragma once

#include <array>

#include "d3/types/enums.hpp"
#include "nn/os/os_mutex_type.hpp"
#include "nn/fs/fs_types.hpp"
#include "bits/allocator.h"
#include "bits/stl_function.h"
#include "bits/unordered_map.h"
#include "bits/functional_hash.h"
#include "../idadefs.h"

namespace Blizzard {

    namespace Util {
        using BitField = _BYTE[0x20];
    }  // namespace Util

    namespace Time {
        using Timestamp   = int64;
        using Microsecond = uint64;
        using Millisecond = uint32;
        using Second      = uint32;
    }  // namespace Time

    namespace Thread {
        struct nnTlsSlot {
            uint32_t _innerValue;
        };
        using TLSDestructor = void (*)(void *);

        struct TLSSlot {
            Blizzard::Thread::TLSDestructor destructor;
            bool                            initialized;
            nnTlsSlot                       tSlot;
        };
    }  // namespace Thread

    namespace Lock {
        using Mutex  = nn::os::MutexType;
        using RMutex = nn::os::MutexType;
    }  // namespace Lock

    namespace File {
        using INODE = int32;
    }  // namespace File

    namespace Storage {
        struct StorageUnit;
        struct StorageUnitHandle {
            Blizzard::File::INODE           mNode;
            Blizzard::Storage::StorageUnit *mUnit;
        };
    }  // namespace Storage

    namespace File {
        struct ALIGNED(4) FileInfo {
            char                     *path;
            int64                     size;
            int64                     sparseSize;
            int32                     attributes;
            Blizzard::Time::Timestamp createTime;
            Blizzard::Time::Timestamp modTime;
            Blizzard::Time::Timestamp accessTime;
            int                       existence;
            bool                      regularFile;
        };

        struct StreamingInfo {
            Blizzard::Storage::StorageUnitHandle storagenode;
            Blizzard::File::INODE                inode;
            int32                                streamRefCount;
            Blizzard::File::FileInfo             streaminginfo;
        };

        struct StreamRecord {
            nn::fs::FileHandle             fileHandle;
            int                            mode;
            bool                           infoValid;
            Blizzard::File::FileInfo       info;
            Blizzard::File::StreamingInfo *streaming;
            char                          *pathname;
        };

        typedef StreamRecord *Stream;

    }  // namespace File

}  // namespace Blizzard

namespace blz {

    template<typename T>
    using char_traits = std::char_traits<T>;

    template<typename T>
    using stlallocator = std::allocator<T>;

    template<typename... Ts>
    struct allocator {
        int8_t gap0[1];
    };

    template<typename T>
    using hash = std::hash<T>;

    template<typename T>
    using stlequal_to = std::equal_to<T>;

    template<typename... Ts>
    struct equal_to {
        int8_t gap0[1];
    };

    template<typename FirstT, typename SecondT>
    struct pair {
        FirstT  first;
        SecondT second;
    };

    template<typename CharT, typename TraitsT = blz::char_traits<CharT>, typename AllocatorT = blz::allocator<CharT>>
    struct basic_string {
        using value_type = CharT;
        using pointer    = value_type *;

        pointer   m_elements;
        size_type m_size;
        uint64_t  m_capacity : 63;
        uint64_t  m_capacity_is_embedded : 1;
        CharT     m_storage[16];

        basic_string();
        basic_string(const char *, u32);
        ~basic_string();
    };

    template<typename T, typename AllocatorT = blz::allocator<T>>
    struct vector {
        using value_type = T;
        using pointer    = value_type *;

        pointer   m_elements;
        size_type m_size;
        uint64_t  m_capacity : 63;
        uint64_t  m_capacity_is_embedded : 1;
    };

    struct _shared_ptr_manager {
        int (**_vptr$_shared_ptr_manager)(void) = (*&_vptr$_shared_ptr_manager);
        int32_t m_use_count                     = 0;
        int32_t m_weak_count                    = 0;
    };

    template<typename T1, bool T2>
    struct _shared_ptr_base {
        T1 *m_pointer;
    };

    template<typename T>
    struct shared_ptr : blz::_shared_ptr_base<T, false> {
        blz::_shared_ptr_manager *m_manager = new _shared_ptr_manager;
    };

    // typedef basic_string<char, blz::char_traits<char>, blz::allocator<char>> string;
    using string = basic_string<char, blz::char_traits<char>, blz::allocator<char>>;

    template<typename T>
    struct chained_hash_node {
        chained_hash_node<T> *next;
        T                     val;
    };

    /* 18749 */
    // typedef blz::chained_hash_node<blz::pair<const int, int>> blz::chained_hash_table<blz::unordered_map_traits<int, int>, blz::hash<int>, blz::equal_to<int>, blz::allocator<blz::pair<const int, int>>>::node_type;
    template<typename T>
    struct ALIGNED(8) chained_hash_table {
        size_t         m_bucket_count;
        T::node_type **m_buckets;
        size_t         m_entry_count;
        float          m_max_load_factor;
    };

    /* 18747 */
    // struct ALIGNED(8) blz::chained_hash_table<blz::unordered_map_traits<int, int>, blz::hash<int>, blz::equal_to<int>, blz::allocator<blz::pair<const int, int>>> {
    //     size_t                                                                                                                                                   m_bucket_count;
    //     blz::chained_hash_table<blz::unordered_map_traits<int, int>, blz::hash<int>, blz::equal_to<int>, blz::allocator<blz::pair<const int, int>>>::node_type **m_buckets;
    //     size_t                                                                                                                                                   m_entry_count;
    //     float                                                                                                                                                    m_max_load_factor;
    // };

    // template<typename T1, typename T2>
    // struct unordered_map : blz::chained_hash_table<blz::unordered_map_traits<T1, T1>, blz::hash<T1>, blz::equal_to<T1>, blz::allocator<blz::pair<const T2, T1>>> {};
    // <T1, T1, blz::hash<T1>, blz::equal_to<T1>, blz::allocator<blz::pair<const T2, T1>>>

}  // namespace blz

namespace Console::Online {

    struct LobbyService {
        int (**_vptr$LobbyService)(void);
    };

    struct bdLobbyEventHandler {
        int (**_vptr$bdLobbyEventHandler)(void);
    };

    struct LobbyServiceInternal : LobbyService, bdLobbyEventHandler {
        struct ALIGNED(8) UpdateFileInfo {
            // blz::embedded_string<128> (0x98)
            _BYTE  m_szFilename[0x98];
            _BYTE  m_szTOCFilename[0x98];
            uint32 m_uFileSize;
            _BYTE  _pad0134[0x4];
            // blz::string (0x28)
            _BYTE m_szBuffer[0x28];
        };

        struct ALIGNED(8) TaskManager {
            // blz::list<bdReference<Console::Online::Task>> (0x18)
            _BYTE m_tTasks[0x18];
            int32 m_bRunning;
            _BYTE _pad001C[0x4];
        };

        enum ConnectionState : int32 {
            CONNSTATE_INACTIVE        = 0x0,
            CONNSTATE_RESOLVE         = 0x1,
            CONNSTATE_RESOLVE_PENDING = 0x2,
            CONNSTATE_AUTH_START      = 0x3,
            CONNSTATE_AUTH_PENDING    = 0x4,
            CONNSTATE_CONNECT         = 0x5,
            CONNSTATE_CONNECTING      = 0x6,
            CONNSTATE_CONNECTED       = 0x7,
            CONNSTATE_DISCONNECTING   = 0x8,
            CONNSTATE_DISCONNECTED    = 0x9,
        };

        using SubscriptionEvent = _BYTE[0x30];
        using ConnectEvent      = SubscriptionEvent;
        using DisconnectEvent   = SubscriptionEvent;
        using NewMailEvent      = SubscriptionEvent;
        using bdOnlineUserID    = bdUInt64;

        bool                        m_bFatalErrorOccurred;          // 0x10
        _BYTE                       _pad0011[0x3];
        int32                       m_nUserIndex;                   // 0x14
        bdTitleID                   m_idTitle;                      // 0x18
        ConnectionState             m_eConnectionState;             // 0x1C
        bool                        m_bWasConnected;                // 0x20
        _BYTE                       _pad0021[0x7];
        bdLobbyService             *m_ptLobbyService;               // 0x28
        bdAuthSwitch               *m_ptAuthService;                // 0x30
        bdNChar8                    m_szNickNameUsedForAuth[32];    // 0x38
        ConnectEvent                m_tConnectEvent;                // 0x58
        DisconnectEvent             m_tDisconnectEvent;             // 0x88
        NewMailEvent                m_tNewMailEvent;                // 0xB8
        int32                       m_bRunningTokenAuthentication;  // 0xE8 (BOOL_0)
        int32                       m_bAttemptConnectForNX64;       // 0xEC (BOOL_0)
        uintptr_t                   m_pfnVerifyNSOCallback;         // 0xF0 (Console::Online::VerifyNSOCallback)
        int32                       m_bReconnect;                   // 0xF8 (BOOL_0)
        int32                       m_bReconnectWhenSignedIn;       // 0xFC (BOOL_0)
        Blizzard::Time::Millisecond m_uLastReconnectAttemptMS;      // 0x100
        Blizzard::Time::Millisecond m_uReconnectDelayMS;            // 0x104
        bdOnlineUserID              m_idOnlineUser;                 // 0x108
        int32                       m_bCheckedForBnetAccount;       // 0x110 (BOOL_0)
        int32                       m_nBalanceVersion;              // 0x114
        UpdateFileInfo              m_atUpdateFiles[2];             // 0x118
        int32                       m_nFileInProgress;              // 0x3D8
        _BYTE                       _pad03DC[0x4];
        TaskManager                 m_tTaskManager;                 // 0x3E0
    };
    // auto test = sizeof(LobbyServiceInternal);
    // auto test = offsetof(LobbyServiceInternal, m_eConnectionState);
}  // namespace Console::Online

namespace google::protobuf {

    using int32  = int32_t;
    using uint32 = uint32_t;
    using int64  = int64_t;
    using uint64 = uint64_t;

    struct MessageLite {
        /* TODO: */  // uintptr_t __vftable;
        // int (**_vptr$MessageLite)(void);
        int (**_vptr$MessageLite)(void) = (*&_vptr$MessageLite);
    };

    /* TODO: */
    struct Message : MessageLite {};

    struct UnknownFieldSet;

    struct UnknownField {
        google::protobuf::uint32 number_;
        google::protobuf::uint32 type_;
        union $8D969D3D8B1F7C70BA062C04483EF129 {
            google::protobuf::uint64 varint_;
            google::protobuf::uint32 fixed32_;
            google::protobuf::uint64 fixed64_;
